app/views/songs/show.html.erb


<% if @song.artist.empty? %>
---
SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT 1  [["id", 24]]